{
  "MainPage": {
    "categories": {
      "developer": {
        "value": "👨‍💻 Developer"
      },
      "text": {
        "value": "📝 Text"
      },
      "daily": {
        "value": "🔢 Daily Calculator"
      },
      "image": {
        "value": "🖼️ Photo Editing / Retouching"
      },
      "file": {
        "value": "🔄 File Conversion"
      },
      "test": {
        "value": "📋 Test"
      },
      "math": {
        "value": "➗ Math Calculator"
      },
      "lottery": {
        "value": "🎲 Lottery"
      }
    },
    "newWebTool": "Recently Added Web Tools"
  },

  "WebToolsData": {
    "notFindWebtools": "The web tools are not available yet. Please wait a moment 😢",
    "base64EncodeDecode": {
      "title": "Base64 Encoder / Decoder",
      "explain": "Encode text to Base64 format or decode Base64 strings.",
      "category": "developer"
    },
    "countLetters": {
      "title": "Letter Count",
      "explain": "Counts the number of letters.",
      "category": "text"
    },
    "bmiCalculator": {
      "title": "BMI Calculator",
      "explain": "Calculates your BMI value.",
      "category": "daily"
    },
    "rgbHexConverter": {
      "title": "RGB - Hex Converter",
      "explain": "Convert RGB values to Hex codes or vice versa.",
      "category": "developer"
    },
    "qrCodeGenerator": {
      "title": "QR Code Generator",
      "explain": "Quickly convert URL or text into QR codes.",
      "category": "developer"
    }
  },

  "base64EncodeDecode": {
    "title": "Base64 Encoder / Decoder",
    "description": "This page provides a tool for encoding text to Base64 and decoding Base64-encoded strings back to their original text. Enter your string in the input field above and click the buttons to see the transformation results.",
    "inputPlaceholder": "Enter the text to encode in Base64 or the Base64 string to decode.",
    "encodeBtn": "Encode to Base64",
    "decodeBtn": "Decode to Text",
    "input": "Input",
    "output": "Output",
    "noInputError": "The input field is empty. Please check and provide the necessary input.",
    "encodingError": "It seems the input cannot be encoded into Base64 or there's an issue with it.",
    "decodingError": "It seems the input is not a valid Base64 string.",
    "copyBtn": "Copy Result",
    "copySuccess": "Copied successfully!",
    "copyError": "Copy failed. Please try again."
  },

  "base64EncodeDecodeText": {
    "base64Encoding": {
      "title": "Base64 Encoding",
      "description": "Base64 encoding is a method of converting binary data into a text format to maintain data integrity while transmitting. Base64 encoding uses 64 characters (A-Z, a-z, 0-9, +, /) to encode binary data into text.",
      "steps": {
        "1": "Input data is first divided into 8-bit bytes.",
        "2": "These bytes are then grouped into 6-bit blocks. Each 6-bit block is converted to a character in the Base64 character set.",
        "3": "The resulting Base64 string is padded with '=' characters if necessary to make the length a multiple of 4."
      }
    },
    "base64Decoding": {
      "title": "Base64 Decoding",
      "description": "Base64 decoding is the process of converting a Base64-encoded string back into its original binary data to restore the original information.",
      "steps": {
        "1": "Remove '=' characters from the end of the Base64 string.",
        "2": "Convert each Base64 character to its corresponding 6-bit value.",
        "3": "Reconstruct the 8-bit bytes from these 6-bit values to restore the original binary data."
      }
    },
    "usageInstructions": {
      "title": "How to Use",
      "steps": {
        "1": "Text Input: Enter the string you want to encode in Base64 or the Base64 string you want to decode in the text input area.",
        "2": "Encode / Decode: Click the 'Encode to Base64' / 'Decode to String' button to encode the string into Base64 or decode the Base64 string.",
        "3": "Check Results: The converted result will be displayed in the output area.",
        "4": "Copy Result: Click the copy button next to the output area to copy the result to your clipboard."
      }
    },
    "security": {
      "title": "Security",
      "description": "All text entered and information related to encoding / decoding are not stored on the server."
    },
    "freeUsage": {
      "title": "Free to Use",
      "description": "This tool is provided completely free of charge. There is no need to download additional software; it can be used directly from the web."
    },
    "example": {
      "title": "Encoding Example",
      "description": "For example, the string 'Hello World' is converted to an ASCII byte sequence and then encoded in Base64, resulting in: SGVsbG8gV29ybGQ=."
    }
  },

  "countLetters": {
    "title": "Letter Counter",
    "description": "This page is a tool that counts the number of letters you input. Enter a sentence in the input field below, and it will count the letters in real-time.",
    "inputPlaceholder": "Please enter a sentence to count the letters.",
    "input": "Input",
    "output": "Result",
    "charCount": "Total Characters (including spaces)",
    "charCountNoSpaces": "Total Characters (excluding spaces)",
    "wordCount": "Total Words"
  },

  "countLettersText": {
    "overview": {
      "title": "Overview",
      "description": "The 'Count Letters' tool is a simple yet powerful utility that calculates the number of characters, words, and spaces in the text you input, all in real time. Whether you're writing an essay, preparing a report, or tracking the character count for social media, this tool helps you monitor and optimize the length of your text as you type."
    },
    "features": {
      "title": "Key Features",
      "steps": {
        "1": "Real-time Counting: Automatically updates the character, word, and space count as you type.",
        "2": "Flexible Input: Easily paste or type text into the input area.",
        "3": "Detailed Statistics: Displays character count including and excluding spaces, as well as the total word count separately.",
        "4": "User-friendly Interface: Simple, intuitive, and clean layout for easy use."
      }
    },
    "usageInstructions": {
      "title": "How to Use",
      "steps": {
        "1": "Enter Text: Type or paste your text into the provided input area.",
        "2": "Check the Count: The tool will automatically display the character count with and without spaces, as well as the total word count, in real time.",
        "3": "Optimize Your Text: Adjust your text based on the provided counts to meet specific requirements."
      }
    },
    "security": {
      "title": "Security Notice",
      "description": "All text input is processed locally in your browser. Your data is never sent to a server, ensuring that your text remains private and secure from any leaks or monitoring."
    },
    "freeUsage": {
      "title": "Free to Use",
      "description": "This tool is completely free to use and is accessible to everyone. You can use it directly in your web browser without the need to download any software."
    },
    "example": {
      "title": "Example Usage",
      "description": "For example, if you paste the sentence 'Hello World!' into the input area, this tool will count it as 12 characters including spaces, 11 characters excluding spaces, and 2 words."
    },
    "benefits": {
      "title": "Benefits",
      "steps": {
        "1": "Maintain character limits to improve the quality of your writing.",
        "2": "Adjust text to meet the specific requirements of social media, assignments, reports, or other formats.",
        "3": "Receive real-time feedback on text length, making it easier to enhance your editing process."
      }
    }
  },

  "bmiCalculator": {
    "title": "BMI Calculator",
    "description": "This page is a tool for quickly calculating your BMI. Fill in the fields below to get your BMI score.",
    "heightError": "Invalid height input. Please check and try again.",
    "weightError": "Invalid weight input. Please check and try again.",
    "input": "Height and Weight Input",
    "unit": "Select Unit",
    "calculate": "Calculate BMI",
    "result": "Your BMI Score",
    "resultRate": "Your BMI Category",
    "resultRateName": {
      "1": "Underweight",
      "2": "Normal",
      "3": "Overweight",
      "4": "Obesity Class 1",
      "5": "Obesity Class 2",
      "6": "Obesity Class 3"
    }
  },

  "bmiCalculatorText": {
    "overview": {
      "title": "Overview",
      "description": "'BMI Calculator' is a simple yet powerful tool that quickly calculates your Body Mass Index (BMI) based on your height and weight. This tool helps you understand your body composition and manage your health, track weight loss, monitor fitness goals, and maintain a healthy lifestyle."
    },
    "overviewBmi": {
      "title": "BMI Overview",
      "description": "BMI (Body Mass Index) is a metric that evaluates whether an individual's weight falls within a healthy range based on their height and weight. Widely used globally, BMI provides a straightforward way to assess weight and health. The 'BMI Calculator' quickly computes BMI based on your height and weight."
    },
    "calculation": {
      "title": "How BMI is Calculated",
      "description": "BMI is calculated using the following formula: BMI = weight (kg) / (height (m) ^ 2). This formula helps assess whether an individual's weight falls within a healthy range."
    },
    "categories": {
      "title": "BMI Categories",
      "steps": {
        "1": "Underweight: BMI < 18.5",
        "2": "Normal weight: 18.5 ≤ BMI < 25",
        "3": "Overweight: 25 ≤ BMI < 30",
        "4": "Class 1 Obesity: 30 ≤ BMI < 35",
        "5": "Class 2 Obesity: 35 ≤ BMI < 40",
        "6": "Class 3 Obesity: BMI ≥ 40"
      }
    },
    "usageInstructions": {
      "title": "How to Use",
      "steps": {
        "1": "Enter Measurements: Input your height and weight in the provided fields. You can choose your preferred unit system (Metric / Imperial).",
        "2": "Check Results: Click the 'Calculate BMI' button to see your BMI index and its classification.",
        "3": "Optimize Health: Use the provided information to make health decisions, adjust your diet, exercise routine, and manage your well-being."
      }
    },
    "advantages": {
      "title": "Benefits of BMI",
      "steps": {
        "1": "Simplicity and Convenience: BMI is easy to calculate and requires only height and weight measurements.",
        "2": "Utility in Large-Scale Studies: Effective for analyzing health issues at the population level.",
        "3": "Relatively Accessible: A standardized metric that allows comparisons across different regions and ethnicities."
      }
    },
    "limitations": {
      "title": "Limitations of BMI",
      "steps": {
        "1": "Does Not Reflect Fat Distribution: BMI does not account for the distribution of body fat.",
        "2": "Does Not Consider Age and Gender: BMI does not adjust for changes in body composition due to age or gender.",
        "3": "Limited Health Assessment: BMI alone does not provide a complete assessment of health."
      }
    },
    "alternativeMetrics": {
      "title": "Alternative Metrics",
      "steps": {
        "1": "Body Fat Percentage: Represents the proportion of fat in your body weight.",
        "2": "Waist Circumference: Useful for assessing abdominal fat accumulation.",
        "3": "Waist-to-Hip Ratio: Evaluates fat distribution across the waist and hips.",
        "4": "Adjusted BMI with Muscle Mass: A method to adjust BMI by considering muscle mass."
      }
    },
    "security": {
      "title": "Security",
      "description": "All entered data is processed locally in your browser. No data is transmitted to servers, ensuring there is no risk of data leakage."
    },
    "freeUsage": {
      "title": "Free to Use",
      "description": "This tool is available entirely for free and can be used directly from your web browser without the need for software downloads."
    }
  },

  "rgbHexConverter": {
    "title": "RGB/Hex Color Converter",
    "description": "Use this tool to convert RGB values to Hex color codes or vice versa.",
    "inputPlaceholder": "Enter RGB values or Hex color code.\nRGB example: RGB(255, 0, 0) / 255, 0, 0\nHex example: #FF0000 / ff0000 / f00",
    "rgbToHexBtn": "Convert RGB to Hex",
    "hexToRgbBtn": "Convert Hex to RGB",
    "input": "Input",
    "output": "Output",
    "noInputError": "The input field is empty. Please check and provide the necessary input.",
    "invalidColorError": "Invalid color code. Please check and try again.",
    "copyBtn": "Copy Result",
    "copySuccess": "Copied successfully!",
    "copyError": "Copy failed. Please try again."
  },

  "rgbHexConverterText": {
    "rgbToHex": {
      "title": "Convert RGB to Hex",
      "description": "The process of converting RGB values into hexadecimal (Hex) color codes.",
      "steps": {
        "1": "Input three numbers representing RGB values in the range of 0 to 255.",
        "2": "Convert each number to a hexadecimal value.",
        "3": "Combine the three hexadecimal values to get the final Hex code."
      }
    },
    "hexToRgb": {
      "title": "Convert Hex to RGB",
      "description": "The process of converting a hexadecimal (Hex) color code into RGB values.",
      "steps": {
        "1": "Input a Hex code consisting of 6 characters (numbers and letters).",
        "2": "Convert each pair of characters to a decimal value.",
        "3": "Combine the three resulting numbers to get the final RGB value."
      }
    },
    "usageInstructions": {
      "title": "Usage Instructions",
      "steps": {
        "1": "Enter an RGB or Hex color code in the input field.",
        "2": "Click the convert button to see the result.",
        "3": "Check the converted value in the result area.",
        "4": "Click the copy button next to the result to copy it to the clipboard."
      }
    },
    "security": {
      "title": "Security Notice",
      "description": "None of the entered text or converted information is stored on the server."
    },
    "freeUsage": {
      "title": "Free to Use",
      "description": "This tool is offered completely free of charge and can be used directly in the browser without downloading any software."
    },
    "example": {
      "title": "Conversion Example",
      "description": "For example, RGB(255, 0, 0) converts to #FF0000, and the Hex code #00FF00 converts to RGB(0, 255, 0)."
    }
  },

  "qrCodeGenerator": {
    "title": "QR Code Generator",
    "description": "Use this tool to quickly convert URLs or text into QR codes.",
    "inputLabel": "Enter URL / Text",
    "inputPlaceholder": "Enter URL or text here.",
    "outputLabel": "Generated QR Code",
    "copyBtn": "Save QR Code"
  },

  "qrCodeGeneratorText": {
    "usageInstructions": {
      "title": "How to Use",
      "steps": {
        "1": "Enter your desired URL or text in the input area.",
        "2": "The QR code will be generated automatically in real-time as you type.",
        "3": "Click the 'Save QR Code' button to save the generated QR code as a PNG image.",
        "4": "Use the saved QR code wherever you need it (business cards, posters, websites, etc.)."
      }
    },
    "security": {
      "title": "Security and Privacy",
      "description": "We prioritize the protection of your personal information. All input data is processed solely on the client-side and is never stored or transmitted to any server. This ensures that your data remains secure and private."
    },
    "freeUsage": {
      "title": "Free Service",
      "description": "This QR code generator is provided completely free of charge. You can use it immediately without any software installation or registration. There are no usage limits, allowing you to generate high-quality QR codes as many times as you need."
    },
    "features": {
      "title": "Key Features",
      "steps": {
        "1": "Real-time QR Code Generation: QR codes are created instantly as you type.",
        "2": "High-Quality Images: Provides clear, easily scannable high-resolution QR codes.",
        "3": "Versatile Input Support: Convert various data formats including URLs, plain text, and contact information into QR codes.",
        "4": "User-Friendly Interface: Intuitive and easy-to-use design accessible to everyone.",
        "5": "Instant Download: Download your generated QR codes immediately in PNG format."
      }
    },
    "useCases": {
      "title": "Use Cases",
      "description": "QR codes can be useful in various scenarios:",
      "steps": {
        "1": "Adding website links to business cards or promotional materials",
        "2": "Linking online booking pages on event posters",
        "3": "Providing links to detailed information pages on product packaging",
        "4": "Connecting physical menus to online menus",
        "5": "Sharing social media profiles",
        "6": "Sharing Wi-Fi passwords"
      }
    },
    "tips": {
      "title": "QR Code Usage Tips",
      "steps": {
        "1": "Make sure the QR code is large enough for easy scanning.",
        "2": "Use contrasting colors to improve readability.",
        "3": "Regularly test your QR codes to ensure they're working properly.",
        "4": "If necessary, add a brief explanation or call-to-action next to the QR code."
      }
    }
  }
}
