{
  "MainPage": {
    "categories": {
      "developer": {
        "value": "👨‍💻 Developer"
      },
      "text": {
        "value": "📝 Text"
      },
      "daily": {
        "value": "🔢 Daily Calculator"
      },
      "image": {
        "value": "🖼️ Photo Editing / Retouching"
      },
      "file": {
        "value": "🔄 File Conversion"
      },
      "test": {
        "value": "📋 Test"
      },
      "math": {
        "value": "➗ Math Calculator"
      },
      "lottery": {
        "value": "🎲 Lottery"
      }
    },
    "newWebTool": "Recently Added Web Tools"
  },
  "WebToolsData": {
    "notFindWebtools": "The web tools are not available yet. Please wait a moment 😢",
    "base64EncodeDecode": {
      "title": "Base64 Encoder / Decoder",
      "explain": "Encode text to Base64 format or decode Base64 strings.",
      "category": "developer"
    },
    "countLetters": {
      "title": "Letter Count",
      "explain": "Counts the number of letters.",
      "category": "text"
    }
  },
  "base64EncodeDecode": {
    "title": "Base64 Encoder / Decoder",
    "description": "This page provides a tool for encoding text to Base64 and decoding Base64-encoded strings back to their original text. Enter your string in the input field above and click the buttons to see the transformation results.",
    "inputPlaceholder": "Enter the text to encode in Base64 or the Base64 string to decode.",
    "encodeBtn": "Encode to Base64",
    "decodeBtn": "Decode to Text",
    "input": "Input",
    "output": "Output",
    "noInputError": "The input field is empty. Please check and provide the necessary input.",
    "encodingError": "It seems the input cannot be encoded into Base64 or there's an issue with it.",
    "decodingError": "It seems the input is not a valid Base64 string."
  },

  "base64EncodeDecodeText": {
    "base64Encoding": {
      "title": "Base64 Encoding",
      "description": "Base64 encoding is a method of converting binary data into a text format to maintain data integrity while transmitting. Base64 encoding uses 64 characters (A-Z, a-z, 0-9, +, /) to encode binary data into text.",
      "steps": {
        "1": "Input data is first divided into 8-bit bytes.",
        "2": "These bytes are then grouped into 6-bit blocks. Each 6-bit block is converted to a character in the Base64 character set.",
        "3": "The resulting Base64 string is padded with '=' characters if necessary to make the length a multiple of 4."
      }
    },
    "base64Decoding": {
      "title": "Base64 Decoding",
      "description": "Base64 decoding is the process of converting a Base64-encoded string back into its original binary data to restore the original information.",
      "steps": {
        "1": "Remove '=' characters from the end of the Base64 string.",
        "2": "Convert each Base64 character to its corresponding 6-bit value.",
        "3": "Reconstruct the 8-bit bytes from these 6-bit values to restore the original binary data."
      }
    },
    "usageInstructions": {
      "title": "How to Use",
      "steps": {
        "1": "Text Input: Enter the string you want to encode in Base64 or the Base64 string you want to decode in the text input area.",
        "2": "Encode / Decode: Click the 'Encode to Base64' / 'Decode to String' button to encode the string into Base64 or decode the Base64 string.",
        "3": "Check Results: The converted result will be displayed in the output area.",
        "4": "Copy Result: Click the copy button next to the output area to copy the result to your clipboard."
      }
    },
    "security": {
      "title": "Security",
      "description": "All text entered and information related to encoding / decoding are not stored on the server."
    },
    "freeUsage": {
      "title": "Free to Use",
      "description": "This tool is provided completely free of charge. There is no need to download additional software; it can be used directly from the web."
    },
    "example": {
      "title": "Encoding Example",
      "description": "For example, the string 'Hello World' is converted to an ASCII byte sequence and then encoded in Base64, resulting in: SGVsbG8gV29ybGQ=."
    }
  },

  "countLetters": {
    "title": "Letter Counter",
    "description": "This page is a tool that counts the number of letters you input. Enter a sentence in the input field below, and it will count the letters in real-time.",
    "inputPlaceholder": "Please enter a sentence to count the letters.",
    "input": "Input",
    "output": "Result",
    "charCount": "Total Characters (including spaces)",
    "charCountNoSpaces": "Total Characters (excluding spaces)",
    "wordCount": "Total Words"
  },

  "countLettersText": {
    "overview": {
      "title": "Overview",
      "description": "The 'Count Letters' tool is a simple yet powerful utility that calculates the number of characters, words, and spaces in the text you input, all in real time. Whether you're writing an essay, preparing a report, or tracking the character count for social media, this tool helps you monitor and optimize the length of your text as you type."
    },
    "features": {
      "title": "Key Features",
      "steps": {
        "1": "Real-time Counting: Automatically updates the character, word, and space count as you type.",
        "2": "Flexible Input: Easily paste or type text into the input area.",
        "3": "Detailed Statistics: Displays character count including and excluding spaces, as well as the total word count separately.",
        "4": "User-friendly Interface: Simple, intuitive, and clean layout for easy use."
      }
    },
    "usageInstructions": {
      "title": "How to Use",
      "steps": {
        "1": "Enter Text: Type or paste your text into the provided input area.",
        "2": "Check the Count: The tool will automatically display the character count with and without spaces, as well as the total word count, in real time.",
        "3": "Optimize Your Text: Adjust your text based on the provided counts to meet specific requirements."
      }
    },
    "security": {
      "title": "Security Notice",
      "description": "All text input is processed locally in your browser. Your data is never sent to a server, ensuring that your text remains private and secure from any leaks or monitoring."
    },
    "freeUsage": {
      "title": "Free to Use",
      "description": "This tool is completely free to use and is accessible to everyone. You can use it directly in your web browser without the need to download any software."
    },
    "example": {
      "title": "Example Usage",
      "description": "For example, if you paste the sentence 'Hello World!' into the input area, this tool will count it as 12 characters including spaces, 11 characters excluding spaces, and 2 words."
    },
    "benefits": {
      "title": "Benefits",
      "steps": {
        "1": "Maintain character limits to improve the quality of your writing.",
        "2": "Adjust text to meet the specific requirements of social media, assignments, reports, or other formats.",
        "3": "Receive real-time feedback on text length, making it easier to enhance your editing process."
      }
    }
  }
}
