{
  "syntaxHighlighter": {
    "meta": {
      "title": "코드 하이라이터 - WebTool Stack",
      "description": "소스 코드를 보기 좋게 만들어주며, 이미지로 다운로드하거나, 공유할 수 있습니다."
    },
    "title": "소스 코드 하이라이터",
    "description": "소스 코드를 문법에 맞게 하이라이팅하여 보기 좋게 만들어주며, 이를 이미지로 다운로드하거나, 쉽게 공유할 수 있습니다.",
    "input": "소스 코드 입력",
    "inputPlaceholder": "여기에 소스 코드를 입력하거나, 붙여넣으세요.",
    "languageSelect": "프로그래밍 언어 선택 / 검색",
    "output": "하이라이트된 소스 코드",
    "isWrapLine": "줄바꿈 켜기",
    "isLineNumber": "줄번호 켜기",
    "isDark": "다크모드 켜기",
    "saveBtn": "이미지로 저장",
    "shareBtn": "공유하기"
  },

  "syntaxHighlighterText": {
    "overview": {
      "title": "개요",
      "description": "'코드 하이라이터'는 다양한 프로그래밍 언어의 소스 코드를 문법에 맞게 하이라이팅하여 보기 좋게 만들어주며, 이를 이미지로 저장하거나 쉽게 공유할 수 있는 강력한 도구입니다. 이 도구는 프로그래머, 기술 작가, 교육자 등이 코드를 더 읽기 쉽고 이해하기 쉽게 만드는 데 도움을 줍니다."
    },
    "features": {
      "title": "주요 기능",
      "steps": {
        "1": "다양한 프로그래밍 언어 지원: JavaScript, TypeScript, JSX, Python, Java, C#, C++, HTML, CSS 등 주요 언어뿐만 아니라 약 270여 가지의 프로그래밍 언어들을 모두 지원합니다.",
        "2": "실시간 구문 강조: 입력된 코드가 자동으로 하이라이팅되어 즉시 확인할 수 있습니다.",
        "3": "테마 선택: 밝은 테마와 어두운 테마 중에서 선택하여 시각적으로 편안한 환경을 제공합니다.",
        "4": "사용자 맞춤 설정: 코드에 줄 번호를 추가하거나, 줄바꿈을 허용하는 등의 커스터마이징 옵션을 제공합니다.",
        "5": "이미지 저장: 하이라이팅된 코드를 PNG 파일로 저장하여 문서나 발표 자료에 쉽게 추가할 수 있습니다.",
        "6": "코드 공유: 소셜 미디어나 이메일을 통해 하이라이팅된 코드를 손쉽게 공유할 수 있는 기능을 제공합니다."
      }
    },
    "usageInstructions": {
      "title": "사용 방법",
      "steps": {
        "1": "언어 선택: 드롭다운 메뉴에서 지원되는 프로그래밍 언어를 선택합니다.",
        "2": "코드 입력: 텍스트 영역에 하이라이팅하고 싶은 코드를 붙여넣거나 직접 입력합니다.",
        "3": "결과 확인: 입력한 코드가 자동으로 하이라이팅되어 결과를 바로 확인할 수 있습니다.",
        "4": "이미지 저장/공유: '이미지로 저장' 버튼을 클릭하여 결과를 이미지 파일로 저장하거나, '공유' 버튼을 클릭하여 소스코드 이미지를 공유합니다."
      }
    },
    "benefits": {
      "title": "장점",
      "steps": {
        "1": "가독성 향상: 문법에 맞는 색상 강조로 코드의 구조와 의미를 쉽게 파악할 수 있습니다.",
        "2": "교육 도구: 프로그래밍 개념을 설명할 때 효과적인 시각적 자료를 제공하여 이해를 돕습니다.",
        "3": "문서화 개선: 기술 문서나 블로그 포스트에 포함된 코드 스니펫이 더 보기 좋고 전문적으로 보입니다.",
        "4": "협업 촉진: 팀원들과 코드의 특정 부분을 강조하여 논의할 때 유용합니다."
      }
    },
    "security": {
      "title": "보안 사항",
      "description": "모든 코드 처리는 클라이언트 측에서 이루어지며, 입력된 코드는 서버로 전송되지 않습니다. 따라서 민감한 코드도 안전하게 사용할 수 있습니다."
    }
  }
}
